{"format": "graph-model", "generatedBy": "2.20.0", "convertedBy": "TensorFlow.js Converter v3.18.0", "signature": {"inputs": {"input_layer": {"name": "input_layer:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "10"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "8"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "5"}, {"size": "5"}, {"size": "8"}, {"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Squeeze", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "16"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack_1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack_2", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape/1", "op": "Const", "attr": {"dtype": {"type": "DT_INT32"}, "value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "256"}, {"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "10"}]}}}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "10"}]}}}}}, {"name": "input_layer", "op": "Placeholder", "attr": {"dtype": {"type": "DT_FLOAT"}, "shape": {"shape": {"dim": [{"size": "-1"}, {"size": "28"}, {"size": "28"}, {"size": "1"}]}}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Relu", "op": "_FusedConv2D", "input": ["input_layer", "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1/Squeeze"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-3"}, {"size": "-4"}, {"size": "-5"}]}, {"dim": [{"size": "5"}, {"size": "5"}, {"size": "1"}, {"size": "8"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "num_host_args": {"i": "0"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "num_args": {"i": "1"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1/MaxPool2d", "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "StatefulPartitionedCall/sequential_1/conv2d_1_2/Squeeze"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-2"}, {"size": "-8"}, {"size": "-9"}, {"size": "8"}]}, {"dim": [{"size": "5"}, {"size": "5"}, {"size": "8"}, {"size": "16"}]}]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "num_host_args": {"i": "0"}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "num_args": {"i": "1"}, "filter_format": {"s": "SFdJTw=="}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "epsilon": {"f": 0.0}, "leakyrelu_alpha": {"f": 0.2}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d", "op": "MaxPool", "input": ["StatefulPartitionedCall/sequential_1/conv2d_1_2/Relu"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "ksize": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "T": {"type": "DT_FLOAT"}, "padding": {"s": "VkFMSUQ="}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Shape", "op": "Shape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d"], "attr": {"T": {"type": "DT_FLOAT"}, "out_type": {"type": "DT_INT32"}}, "experimentalType": {"typeId": "TFT_PRODUCT", "args": [{"typeId": "TFT_SHAPE_TENSOR", "args": [{"typeId": "TFT_INT32"}]}]}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice", "op": "StridedSlice", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Shape", "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack", "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack_1", "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack_2"], "attr": {"T": {"type": "DT_INT32"}, "Index": {"type": "DT_INT32"}, "shrink_axis_mask": {"i": "1"}, "new_axis_mask": {"i": "0"}, "end_mask": {"i": "0"}, "ellipsis_mask": {"i": "0"}, "begin_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape", "op": "Pack", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/strided_slice", "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape/1"], "attr": {"T": {"type": "DT_INT32"}, "axis": {"i": "0"}, "N": {"i": "2"}}}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/sequential_1/max_pooling2d_1_2/MaxPool2d", "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape"], "attr": {"Tshape": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Relu", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/flatten_1/Reshape", "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-14"}, {"size": "256"}]}, {"dim": [{"size": "256"}, {"size": "128"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA==", "UmVsdQ=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd", "op": "_FusedMatMul", "input": ["StatefulPartitionedCall/sequential_1/dense_1/Relu", "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd/ReadVariableOp"], "device": "/device:CPU:0", "attr": {"_input_shapes": {"list": {"shape": [{"dim": [{"size": "-14"}, {"size": "128"}]}, {"dim": [{"size": "128"}, {"size": "10"}]}]}}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "T": {"type": "DT_FLOAT"}, "transpose_b": {"b": false}, "epsilon": {"f": 0.0}, "num_args": {"i": "1"}, "leakyrelu_alpha": {"f": 0.2}, "transpose_a": {"b": false}}}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "Identity", "op": "Identity", "input": ["StatefulPartitionedCall/sequential_1/dense_1_2/Softmax"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 2288}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "StatefulPartitionedCall/sequential_1/conv2d_1/convolution/ReadVariableOp", "shape": [5, 5, 1, 8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1/Squeeze", "shape": [8], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/convolution/ReadVariableOp", "shape": [5, 5, 8, 16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/conv2d_1_2/Squeeze", "shape": [16], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack_1", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/strided_slice/stack_2", "shape": [1], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/flatten_1/Reshape/shape/1", "shape": [], "dtype": "int32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/Cast/ReadVariableOp", "shape": [256, 128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1/BiasAdd/ReadVariableOp", "shape": [128], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/Cast/ReadVariableOp", "shape": [128, 10], "dtype": "float32"}, {"name": "StatefulPartitionedCall/sequential_1/dense_1_2/BiasAdd/ReadVariableOp", "shape": [10], "dtype": "float32"}]}]}